Raul-dot-valdez/aws-iot-device-sdk-embedded-C/papr/hal/gd32e517re/papr_hal_gd32e517re.c
/* HAL implementation for the GigaDevice GD32E517RE.
 *
 *   Core      : Cortex-M33 with FPU, 180 MHz from a 25 MHz HXTAL via PLL
 *   Package   : LQFP64 (51 GPIOs)
 *   Flash/RAM : 512 KB / 128 KB
 *
 * The file targets the official GD32E51x firmware library (`gd32e51x.h` and
 * the standard peripheral drivers). It is *not* part of the host build —
 * CMake includes it only when PAPR_TARGET=GD32E517RE, which also pulls in
 * the GigaDevice startup file and linker script supplied via GD32E51X_SDK_DIR. */

#ifdef GD32E51X

#include "gd32e51x.h"
#include "papr_config.h"
#include "papr_hal.h"
#include "papr_pinmap.h"

/* ------------------------------------------------------------------------- */
/* Globals                                                                   */
/* ------------------------------------------------------------------------- */

static volatile uint32_t s_tick_ms;
static volatile bool     s_diag_pending;
static volatile uint32_t s_diag_edge_ms;
static volatile uint16_t s_tacho_rpm;

/* Tacho counter sampling window. */
#define TACHO_SAMPLE_PERIOD_MS  100U

/* ADC reference (VDDA, mV) and resolution. */
#define ADC_VREF_MV             3300U
#define ADC_FULL_SCALE          4095U

/* Battery divider: pack 16.8 V → ADC ≤ 3.3 V → ratio = (R1+R2)/R2 = 220/43.   */
#define VBAT_DIV_NUM            220U
#define VBAT_DIV_DEN            43U

/* Shunt amp: 50 mΩ shunt, ×50 amplifier → 2.5 V/A → 1 mA = 2.5 ADC counts.  */
#define IBAT_MA_PER_COUNT_NUM   1U
#define IBAT_MA_PER_COUNT_DEN   3U      /* ≈ ADC_VREF / (full_scale * 2.5)  */

/* Flow sensor: 0–5 V mapped through divider to 0–3.0 V on ADC, full-scale  */
/* corresponds to 250 LPM.                                                  */
#define FLOW_FULL_SCALE_LPM     250U

/* ------------------------------------------------------------------------- */
/* Clock and SysTick                                                         */
/* ------------------------------------------------------------------------- */

static void clock_init(void)
{
    /* SystemInit() (vendor) brings the PLL up to 180 MHz from HXTAL.       */
    SysTick_Config(SystemCoreClock / 1000U);
    NVIC_SetPriority(SysTick_IRQn, 0U);
}

void SysTick_Handler(void)
{
    ++s_tick_ms;

    /* Periodically latch the TACHO accumulator into an RPM estimate.       */
    static uint32_t s_last_sample_ms;
    static uint32_t s_last_count;
    if ((s_tick_ms - s_last_sample_ms) >= TACHO_SAMPLE_PERIOD_MS)
    {
        uint32_t count  = (uint32_t)timer_counter_read(PAPR_TACHO_TIMER);
        uint32_t delta  = (uint32_t)(count - s_last_count) & 0xFFFFU;
        s_last_count    = count;
        s_last_sample_ms = s_tick_ms;

        /* RPM = pulses_per_sec * 60 / PPR
         *     = (delta / 0.1 s) * 60 / PPR
         *     = delta * 600 / PPR                                         */
        uint32_t rpm = (delta * 600U) / PAPR_L6235_TACHO_PPR;
        if (rpm > 0xFFFFU) { rpm = 0xFFFFU; }
        s_tacho_rpm = (uint16_t)rpm;
    }
}

uint32_t papr_hal_now_ms(void)
{
    return s_tick_ms;
}

/* ------------------------------------------------------------------------- */
/* GPIO bring-up                                                             */
/* ------------------------------------------------------------------------- */

static void gpio_clocks_enable(void)
{
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_GPIOB);
    rcu_periph_clock_enable(RCU_GPIOC);
    rcu_periph_clock_enable(RCU_AF);
}

static void l6235_pins_init(void)
{
    gpio_init(PAPR_PIN_L6235_EN_PORT,    GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ,
              PAPR_PIN_L6235_EN_PIN);
    gpio_init(PAPR_PIN_L6235_FWD_PORT,   GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ,
              PAPR_PIN_L6235_FWD_PIN);
    gpio_init(PAPR_PIN_L6235_BRAKE_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ,
              PAPR_PIN_L6235_BRAKE_PIN);

    /* Defaults: bridge disabled, brake engaged, direction = forward.       */
    gpio_bit_reset(PAPR_PIN_L6235_EN_PORT,    PAPR_PIN_L6235_EN_PIN);
    gpio_bit_reset(PAPR_PIN_L6235_BRAKE_PORT, PAPR_PIN_L6235_BRAKE_PIN);
    gpio_bit_set(  PAPR_PIN_L6235_FWD_PORT,   PAPR_PIN_L6235_FWD_PIN);

    /* DIAG input with internal pull-up. */
    gpio_init(PAPR_PIN_L6235_DIAG_PORT, GPIO_MODE_IPU, GPIO_OSPEED_50MHZ,
              PAPR_PIN_L6235_DIAG_PIN);
    gpio_exti_source_select(PAPR_PIN_L6235_DIAG_EXTI_PORT_SRC,
                            PAPR_PIN_L6235_DIAG_EXTI_SRC);
    exti_init(PAPR_PIN_L6235_DIAG_EXTI, EXTI_INTERRUPT, EXTI_TRIG_FALLING);
    exti_interrupt_flag_clear(PAPR_PIN_L6235_DIAG_EXTI);
    nvic_irq_enable(EXTI10_15_IRQn, 1U, 0U);

    /* TACHO input as TIMER1_CH0 alternate function. */
    gpio_init(PAPR_PIN_L6235_TACHO_PORT, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ,
              PAPR_PIN_L6235_TACHO_PIN);
}

static void ui_pins_init(void)
{
    gpio_init(PAPR_PIN_BTN_POWER_PORT, GPIO_MODE_IPU, GPIO_OSPEED_50MHZ,
              PAPR_PIN_BTN_POWER_PIN);
    gpio_init(PAPR_PIN_BTN_LEVEL_PORT, GPIO_MODE_IPU, GPIO_OSPEED_50MHZ,
              PAPR_PIN_BTN_LEVEL_PIN);

    gpio_init(PAPR_PIN_LED_OK_PORT,    GPIO_MODE_OUT_PP, GPIO_OSPEED_2MHZ,
              PAPR_PIN_LED_OK_PIN);
    gpio_init(PAPR_PIN_LED_WARN_PORT,  GPIO_MODE_OUT_PP, GPIO_OSPEED_2MHZ,
              PAPR_PIN_LED_WARN_PIN);
    gpio_init(PAPR_PIN_LED_FAULT_PORT, GPIO_MODE_OUT_PP, GPIO_OSPEED_2MHZ,
              PAPR_PIN_LED_FAULT_PIN);
}

/* ------------------------------------------------------------------------- */
/* DAC for L6235 VREF                                                        */
/* ------------------------------------------------------------------------- */

static void dac_init_vref(void)
{
    rcu_periph_clock_enable(RCU_DAC);
    gpio_init(PAPR_PIN_L6235_VREF_PORT, GPIO_MODE_AIN, GPIO_OSPEED_50MHZ,
              PAPR_PIN_L6235_VREF_PIN);

    dac_deinit();
    dac_trigger_disable(PAPR_DAC_CHANNEL);
    dac_wave_mode_config(PAPR_DAC_CHANNEL, DAC_WAVE_DISABLE);
    dac_output_buffer_enable(PAPR_DAC_CHANNEL);
    dac_data_set(PAPR_DAC_CHANNEL, DAC_ALIGN_12B_R, 0U);
    dac_enable(PAPR_DAC_CHANNEL);
}

papr_status_t papr_hal_l6235_set_vref(uint16_t code)
{
    if (code > PAPR_L6235_VREF_DAC_MAX) { code = PAPR_L6235_VREF_DAC_MAX; }
    /* Scale the controller's 0..PAPR_L6235_VREF_DAC_MAX range into the
     * 12-bit DAC register. They match (4095) by default but the stage stays
     * here in case the controller is rebuilt with a coarser resolution. */
    uint32_t dac_code = ((uint32_t)code * 4095U) / PAPR_L6235_VREF_DAC_MAX;
    dac_data_set(PAPR_DAC_CHANNEL, DAC_ALIGN_12B_R, (uint16_t)dac_code);
    return PAPR_OK;
}

papr_status_t papr_hal_l6235_set_enable(bool enable)
{
    if (enable) { gpio_bit_set(PAPR_PIN_L6235_EN_PORT, PAPR_PIN_L6235_EN_PIN); }
    else        { gpio_bit_reset(PAPR_PIN_L6235_EN_PORT, PAPR_PIN_L6235_EN_PIN); }
    return PAPR_OK;
}

