Raul-dot-valdez/aws-iot-device-sdk-embedded-C/papr/hal/gd32e517re/papr_hal_gd32e517re.c
papr_status_t papr_hal_l6235_set_forward(bool forward)
{
    if (forward) { gpio_bit_set(PAPR_PIN_L6235_FWD_PORT, PAPR_PIN_L6235_FWD_PIN); }
    else         { gpio_bit_reset(PAPR_PIN_L6235_FWD_PORT, PAPR_PIN_L6235_FWD_PIN); }
    return PAPR_OK;
}

papr_status_t papr_hal_l6235_set_brake(bool brake_engaged)
{
    /* BRAKE on the L6235 is active LOW. */
    if (brake_engaged) { gpio_bit_reset(PAPR_PIN_L6235_BRAKE_PORT, PAPR_PIN_L6235_BRAKE_PIN); }
    else               { gpio_bit_set(PAPR_PIN_L6235_BRAKE_PORT,   PAPR_PIN_L6235_BRAKE_PIN); }
    return PAPR_OK;
}

bool papr_hal_l6235_diag_active(void)
{
    if (!s_diag_pending) { return false; }
    /* Debounce: ignore edges shorter than DIAG_DEBOUNCE_MS. */
    if ((s_tick_ms - s_diag_edge_ms) < PAPR_L6235_DIAG_DEBOUNCE_MS)
    {
        return false;
    }
    bool low = (gpio_input_bit_get(PAPR_PIN_L6235_DIAG_PORT,
                                   PAPR_PIN_L6235_DIAG_PIN) == RESET);
    if (!low) { s_diag_pending = false; }
    return low;
}

void EXTI10_15_IRQHandler(void)
{
    if (exti_interrupt_flag_get(PAPR_PIN_L6235_DIAG_EXTI) != RESET)
    {
        exti_interrupt_flag_clear(PAPR_PIN_L6235_DIAG_EXTI);
        s_diag_pending = true;
        s_diag_edge_ms = s_tick_ms;
    }
}

/* ------------------------------------------------------------------------- */
/* TACHO counter                                                             */
/* ------------------------------------------------------------------------- */

static void tacho_timer_init(void)
{
    rcu_periph_clock_enable(RCU_TIMER1);
    timer_deinit(PAPR_TACHO_TIMER);

    timer_parameter_struct cfg;
    timer_struct_para_init(&cfg);
    cfg.prescaler         = 0U;
    cfg.alignedmode       = TIMER_COUNTER_EDGE;
    cfg.counterdirection  = TIMER_COUNTER_UP;
    cfg.period            = 0xFFFFU;
    cfg.clockdivision     = TIMER_CKDIV_DIV1;
    timer_init(PAPR_TACHO_TIMER, &cfg);

    timer_slave_mode_select(PAPR_TACHO_TIMER, TIMER_SLAVE_MODE_EXTERNAL0);
    timer_input_trigger_source_select(PAPR_TACHO_TIMER, TIMER_SMCFG_TRGSEL_CI0FE0);
    timer_input_capture_struct ic;
    ic.icpolarity   = TIMER_IC_POLARITY_RISING;
    ic.icselection  = TIMER_IC_SELECTION_DIRECTTI;
    ic.icprescaler  = TIMER_IC_PSC_DIV1;
    ic.icfilter     = 0x4U;
    timer_input_capture_config(PAPR_TACHO_TIMER, TIMER_CH_0, &ic);
    timer_enable(PAPR_TACHO_TIMER);
}

papr_status_t papr_hal_l6235_read_tacho_rpm(uint16_t *out)
{
    if (out == NULL) { return PAPR_ERR_PARAM; }
    *out = s_tacho_rpm;
    return PAPR_OK;
}

/* ------------------------------------------------------------------------- */
/* ADC for battery, flow, temperature                                        */
/* ------------------------------------------------------------------------- */

static void adc_init_papr(void)
{
    rcu_periph_clock_enable(RCU_ADC0);
    rcu_adc_clock_config(RCU_CKADC_CKAPB2_DIV6); /* 30 MHz max ADC clock   */

    gpio_init(PAPR_PIN_VBAT_PORT, GPIO_MODE_AIN, GPIO_OSPEED_50MHZ, PAPR_PIN_VBAT_PIN);
    gpio_init(PAPR_PIN_IBAT_PORT, GPIO_MODE_AIN, GPIO_OSPEED_50MHZ, PAPR_PIN_IBAT_PIN);
    gpio_init(PAPR_PIN_FLOW_PORT, GPIO_MODE_AIN, GPIO_OSPEED_50MHZ, PAPR_PIN_FLOW_PIN);
    gpio_init(PAPR_PIN_TEMP_PORT, GPIO_MODE_AIN, GPIO_OSPEED_50MHZ, PAPR_PIN_TEMP_PIN);

    adc_deinit(ADC0);
    adc_mode_config(ADC_MODE_FREE);
    adc_data_alignment_config(ADC0, ADC_DATAALIGN_RIGHT);
    adc_resolution_config(ADC0, ADC_RESOLUTION_12B);
    adc_external_trigger_source_config(ADC0, ADC_REGULAR_CHANNEL,
                                       ADC0_1_EXTTRIG_REGULAR_NONE);
    adc_external_trigger_config(ADC0, ADC_REGULAR_CHANNEL, ENABLE);
    adc_special_function_config(ADC0, ADC_CONTINUOUS_MODE, DISABLE);
    adc_special_function_config(ADC0, ADC_SCAN_MODE, DISABLE);
    adc_enable(ADC0);
    delay_1ms(1U);
    adc_calibration_enable(ADC0);
}

static uint16_t adc_sample(uint8_t channel)
{
    adc_regular_channel_config(ADC0, 0U, channel, ADC_SAMPLETIME_239POINT5);
    adc_software_trigger_enable(ADC0, ADC_REGULAR_CHANNEL);
    while (adc_flag_get(ADC0, ADC_FLAG_EOC) == RESET) { /* spin */ }
    adc_flag_clear(ADC0, ADC_FLAG_EOC);
    return (uint16_t)adc_regular_data_read(ADC0);
}

papr_status_t papr_hal_read_battery_mv(uint16_t *out)
{
    if (out == NULL) { return PAPR_ERR_PARAM; }
    uint32_t code = adc_sample((uint8_t)PAPR_ADC_VBAT_CH);
    uint32_t mv   = (code * ADC_VREF_MV) / ADC_FULL_SCALE;
    mv            = (mv * VBAT_DIV_NUM) / VBAT_DIV_DEN;
    if (mv > 0xFFFFU) { mv = 0xFFFFU; }
    *out = (uint16_t)mv;
    return PAPR_OK;
}

papr_status_t papr_hal_read_battery_ma(uint16_t *out)
{
    if (out == NULL) { return PAPR_ERR_PARAM; }
    uint32_t code = adc_sample((uint8_t)PAPR_ADC_IBAT_CH);
    uint32_t ma   = (code * IBAT_MA_PER_COUNT_NUM) / IBAT_MA_PER_COUNT_DEN;
    if (ma > 0xFFFFU) { ma = 0xFFFFU; }
    *out = (uint16_t)ma;
    return PAPR_OK;
}

papr_status_t papr_hal_read_flow_lpm(uint16_t *out)
{
    if (out == NULL) { return PAPR_ERR_PARAM; }
    uint32_t code = adc_sample((uint8_t)PAPR_ADC_FLOW_CH);
    uint32_t lpm  = (code * FLOW_FULL_SCALE_LPM) / ADC_FULL_SCALE;
    *out = (uint16_t)lpm;
    return PAPR_OK;
}

papr_status_t papr_hal_read_temperature_c10(int16_t *out)
{
    if (out == NULL) { return PAPR_ERR_PARAM; }
    /* Beta-equation conversion for a 10 kΩ NTC, β = 3950, in series with a
     * 10 kΩ pull-up to VDDA. Approximate around 25 °C using a precomputed
     * lookup; replace with a full table for accuracy below 10 °C / above
     * 60 °C. */
    uint32_t code = adc_sample((uint8_t)PAPR_ADC_TEMP_CH);
    int32_t mv    = (int32_t)((code * ADC_VREF_MV) / ADC_FULL_SCALE);
    int32_t c10   = 250 + ((1500 - mv) / 18); /* ≈ 5.6 mV/°C around 25 °C */
    if (c10 < -400) { c10 = -400; }
    if (c10 >  900) { c10 =  900; }
    *out = (int16_t)c10;
    return PAPR_OK;
}

/* ------------------------------------------------------------------------- */
/* I²C transport (used by the portable Sensirion SDP810 driver)              */
/* ------------------------------------------------------------------------- */

#define I2C_TIMEOUT_LOOPS  200000U

static void i2c_bus_init(void)
{
    rcu_periph_clock_enable(RCU_I2C0);
    gpio_init(PAPR_PIN_I2C_SCL_PORT, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ,
              PAPR_PIN_I2C_SCL_PIN);
    gpio_init(PAPR_PIN_I2C_SDA_PORT, GPIO_MODE_AF_OD, GPIO_OSPEED_50MHZ,
              PAPR_PIN_I2C_SDA_PIN);

    i2c_deinit(PAPR_I2C_PERIPH);
    i2c_clock_config(PAPR_I2C_PERIPH, 400000U, I2C_DTCY_2);
    i2c_mode_addr_config(PAPR_I2C_PERIPH, I2C_I2CMODE_ENABLE,
                         I2C_ADDFORMAT_7BITS, 0U);
    i2c_enable(PAPR_I2C_PERIPH);
    i2c_ack_config(PAPR_I2C_PERIPH, I2C_ACK_ENABLE);
}

static papr_status_t wait_flag(uint32_t flag)
{
    uint32_t t = I2C_TIMEOUT_LOOPS;
    while (!i2c_flag_get(PAPR_I2C_PERIPH, flag) && --t) { }
    return (t == 0U) ? PAPR_ERR_TIMEOUT : PAPR_OK;
}

static papr_status_t wait_busy_clear(void)
{
    uint32_t t = I2C_TIMEOUT_LOOPS;
    while (i2c_flag_get(PAPR_I2C_PERIPH, I2C_FLAG_I2CBSY) && --t) { }
    return (t == 0U) ? PAPR_ERR_TIMEOUT : PAPR_OK;
}

papr_status_t papr_hal_i2c_write(uint8_t addr7, const uint8_t *data, size_t len)
{
    if (data == NULL || len == 0U) { return PAPR_ERR_PARAM; }
    papr_status_t s = wait_busy_clear();
    if (s != PAPR_OK) { return s; }

    i2c_start_on_bus(PAPR_I2C_PERIPH);
    s = wait_flag(I2C_FLAG_SBSEND);
    if (s != PAPR_OK) { return s; }

    i2c_master_addressing(PAPR_I2C_PERIPH, (uint32_t)(addr7 << 1),
                          I2C_TRANSMITTER);
    s = wait_flag(I2C_FLAG_ADDSEND);
    if (s != PAPR_OK) { return s; }
    i2c_flag_clear(PAPR_I2C_PERIPH, I2C_FLAG_ADDSEND);

    for (size_t i = 0U; i < len; ++i)
    {
        s = wait_flag(I2C_FLAG_TBE);
        if (s != PAPR_OK) { i2c_stop_on_bus(PAPR_I2C_PERIPH); return s; }
        i2c_data_transmit(PAPR_I2C_PERIPH, data[i]);
    }
    s = wait_flag(I2C_FLAG_BTC);
    if (s != PAPR_OK) { i2c_stop_on_bus(PAPR_I2C_PERIPH); return s; }

    i2c_stop_on_bus(PAPR_I2C_PERIPH);
    return PAPR_OK;
}

