Raul-dot-valdez/aws-iot-device-sdk-embedded-C/papr/hal/gd32e517re/papr_hal_gd32e517re.c
    usart_deinit(PAPR_UART_PERIPH);
    usart_baudrate_set(PAPR_UART_PERIPH, PAPR_BLE_UART_BAUD);
    usart_word_length_set(PAPR_UART_PERIPH, USART_WL_8BIT);
    usart_stop_bit_set(PAPR_UART_PERIPH, USART_STB_1BIT);
    usart_parity_config(PAPR_UART_PERIPH, USART_PM_NONE);
    usart_hardware_flow_rts_config(PAPR_UART_PERIPH, USART_RTS_DISABLE);
    usart_hardware_flow_cts_config(PAPR_UART_PERIPH, USART_CTS_DISABLE);
    usart_receive_config(PAPR_UART_PERIPH, USART_RECEIVE_ENABLE);
    usart_transmit_config(PAPR_UART_PERIPH, USART_TRANSMIT_ENABLE);
    usart_enable(PAPR_UART_PERIPH);

    /* RX-not-empty interrupt fills the ring buffer. */
    nvic_irq_enable(USART0_IRQn, 2U, 0U);
    usart_interrupt_enable(PAPR_UART_PERIPH, USART_INT_RBNE);

    s_ble_rx_head = 0U;
    s_ble_rx_tail = 0U;
}

void USART0_IRQHandler(void)
{
    if (usart_interrupt_flag_get(PAPR_UART_PERIPH, USART_INT_FLAG_RBNE) != RESET)
    {
        uint8_t b = (uint8_t)usart_data_receive(PAPR_UART_PERIPH);
        uint16_t next = (uint16_t)((s_ble_rx_head + 1U) % BLE_RX_RING_LEN);
        if (next != s_ble_rx_tail)
        {
            s_ble_rx_buf[s_ble_rx_head] = b;
            s_ble_rx_head = next;
        }
        /* If full, drop the byte. The protocol parser will resync on the
         * 0xAA 0x55 preamble of the next intact frame. */
    }
    /* Clear ORE if it has set so reception keeps running. */
    if (usart_flag_get(PAPR_UART_PERIPH, USART_FLAG_ORERR) != RESET)
    {
        usart_flag_clear(PAPR_UART_PERIPH, USART_FLAG_ORERR);
        (void)usart_data_receive(PAPR_UART_PERIPH);
    }
}

papr_status_t papr_hal_uart_write(const uint8_t *data, size_t len)
{
    if (data == NULL || len == 0U) { return PAPR_ERR_PARAM; }
    for (size_t i = 0U; i < len; ++i)
    {
        uint32_t timeout = 100000U;
        while (usart_flag_get(PAPR_UART_PERIPH, USART_FLAG_TBE) == RESET &&
               --timeout) { }
        if (timeout == 0U) { return PAPR_ERR_TIMEOUT; }
        usart_data_transmit(PAPR_UART_PERIPH, (uint16_t)data[i]);
    }
    uint32_t timeout = 100000U;
    while (usart_flag_get(PAPR_UART_PERIPH, USART_FLAG_TC) == RESET &&
           --timeout) { }
    return (timeout == 0U) ? PAPR_ERR_TIMEOUT : PAPR_OK;
}

bool papr_hal_uart_read_byte(uint8_t *out)
{
    if (out == NULL || s_ble_rx_head == s_ble_rx_tail) { return false; }
    *out = s_ble_rx_buf[s_ble_rx_tail];
    s_ble_rx_tail = (uint16_t)((s_ble_rx_tail + 1U) % BLE_RX_RING_LEN);
    return true;
}

papr_status_t papr_hal_ble_set_reset(bool asserted)
{
    if (asserted) { gpio_bit_reset(PAPR_PIN_BLE_RESET_PORT, PAPR_PIN_BLE_RESET_PIN); }
    else          { gpio_bit_set(PAPR_PIN_BLE_RESET_PORT,   PAPR_PIN_BLE_RESET_PIN); }
    return PAPR_OK;
}

bool papr_hal_ble_host_wake(void)
{
    return gpio_input_bit_get(PAPR_PIN_BLE_WAKE_PORT,
                              PAPR_PIN_BLE_WAKE_PIN) != RESET;
}

/* ------------------------------------------------------------------------- */
/* OTA flash (FMC) — dual-bank application slots                             */
/* ------------------------------------------------------------------------- */
/*
 * Reference 512 KB flash map (see ARCHITECTURE.md "OTA flash map"):
 *   0x08000000  bootloader        32 KB
 *   0x08008000  slot A (app)     240 KB   <- one of these runs
 *   0x08044000  slot B (staging) 240 KB   <- OTA writes the other
 *   last page of each slot holds the boot metadata (magic|size|crc|version).
 *
 * The running image is whichever slot the bootloader jumped into. The HAL
 * picks the *other* slot as the staging target. For a bootloader-less dev
 * build (single image linked at slot A) staging is always slot B.
 */
#define OTA_SLOT_A_BASE   0x08008000U
#define OTA_SLOT_B_BASE   0x08044000U
#define OTA_SLOT_BYTES    (240U * 1024U)
#define OTA_META_MAGIC    0x50415052U   /* "PAPR" */
#define OTA_FLASH_PAGE    2048U          /* GD32E51x main-flash page = 2 KB */

/* Determine which slot we are executing from so we stage into the other. */
static uint32_t ota_running_slot_base(void)
{
    uint32_t pc_region = OTA_SLOT_A_BASE;
    /* SCB->VTOR points at the active vector table = start of the running
     * image. Compare against the slot bases. */
    uint32_t vtor = SCB->VTOR;
    if (vtor >= OTA_SLOT_B_BASE) { pc_region = OTA_SLOT_B_BASE; }
    else                         { pc_region = OTA_SLOT_A_BASE; }
    return pc_region;
}

static uint32_t ota_staging_base(void)
{
    return (ota_running_slot_base() == OTA_SLOT_A_BASE)
            ? OTA_SLOT_B_BASE : OTA_SLOT_A_BASE;
}

uint32_t papr_hal_ota_slot_size(void)
{
    /* Reserve the final page for boot metadata. */
    return OTA_SLOT_BYTES - OTA_FLASH_PAGE;
}

papr_status_t papr_hal_ota_erase(void)
{
    uint32_t base = ota_staging_base();
    fmc_unlock();
    papr_status_t rc = PAPR_OK;
    for (uint32_t off = 0U; off < OTA_SLOT_BYTES; off += OTA_FLASH_PAGE)
    {
        if (fmc_page_erase(base + off) != FMC_READY) { rc = PAPR_ERR_HW; break; }
        papr_hal_wdt_kick();   /* erasing 240 KB exceeds the WDT window */
    }
    fmc_lock();
    return rc;
}

papr_status_t papr_hal_ota_write(uint32_t offset, const uint8_t *data, uint32_t len)
{
    if (data == NULL) { return PAPR_ERR_PARAM; }
    uint32_t base = ota_staging_base();
    fmc_unlock();
    papr_status_t rc = PAPR_OK;
    uint32_t i = 0U;
    while (i < len)
    {
        uint32_t word = 0xFFFFFFFFU;
        uint32_t take = ((len - i) >= 4U) ? 4U : (len - i);
        for (uint32_t b = 0U; b < take; ++b)
        {
            ((uint8_t *)&word)[b] = data[i + b];
        }
        if (fmc_word_program(base + offset + i, word) != FMC_READY)
        {
            rc = PAPR_ERR_HW;
            break;
        }
        i += 4U;
    }
    fmc_lock();
    return rc;
}

papr_status_t papr_hal_ota_read(uint32_t offset, uint8_t *data, uint32_t len)
{
    if (data == NULL) { return PAPR_ERR_PARAM; }
    const uint8_t *src = (const uint8_t *)(ota_staging_base() + offset);
    for (uint32_t i = 0U; i < len; ++i) { data[i] = src[i]; }
    return PAPR_OK;
}

papr_status_t papr_hal_ota_commit(uint32_t size, uint32_t crc32)
{
    /* Write the boot metadata into the last page of the staging slot. The
     * bootloader reads MAGIC + size + crc to decide whether to boot it and,
     * after a successful boot, marks it as the new active slot. */
    uint32_t meta = ota_staging_base() + OTA_SLOT_BYTES - OTA_FLASH_PAGE;
    fmc_unlock();
    papr_status_t rc = PAPR_OK;
    if (fmc_page_erase(meta) != FMC_READY) { rc = PAPR_ERR_HW; }
    if (rc == PAPR_OK && fmc_word_program(meta + 0U,  OTA_META_MAGIC) != FMC_READY) { rc = PAPR_ERR_HW; }
    if (rc == PAPR_OK && fmc_word_program(meta + 4U,  size)           != FMC_READY) { rc = PAPR_ERR_HW; }
    if (rc == PAPR_OK && fmc_word_program(meta + 8U,  crc32)          != FMC_READY) { rc = PAPR_ERR_HW; }
    fmc_lock();
    return rc;
}

void papr_hal_ota_reboot(void)
{
    __disable_irq();
    NVIC_SystemReset();   /* does not return */
}

/* ------------------------------------------------------------------------- */
/* Watchdog                                                                  */
/* ------------------------------------------------------------------------- */

static void wdt_init(void)
{
    rcu_osci_on(RCU_IRC40K);
    while (rcu_flag_get(RCU_FLAG_IRC40KSTB) == RESET) { /* spin */ }
    fwdgt_config(250U, FWDGT_PSC_DIV32); /* ≈ 200 ms timeout */
    fwdgt_enable();
}

void papr_hal_wdt_kick(void)
{
    fwdgt_counter_reload();
}

/* ------------------------------------------------------------------------- */
/* Top-level init                                                            */
/* ------------------------------------------------------------------------- */

papr_status_t papr_hal_init(void)
{
    s_tick_ms      = 0U;
    s_diag_pending = false;
    s_diag_edge_ms = 0U;
    s_tacho_rpm    = 0U;

    clock_init();
    gpio_clocks_enable();
    l6235_pins_init();
    ui_pins_init();
    dac_init_vref();
    tacho_timer_init();
    adc_init_papr();
    i2c_bus_init();
    keypad_init();
    buzzer_init();
    ble_uart_init();
    wdt_init();
    return PAPR_OK;
}

#endif /* GD32E51X */
